/**
* @file		Button.cpp
* @breif	Buttonクラス実装
* @author	haga
*/

//-----------------------------------------------------------------------------------------------------------//
//Includes
//-----------------------------------------------------------------------------------------------------------//

#include "GameLib/GameLib.h"
#include "Button.h"

//-----------------------------------------------------------------------------------------------------------//
//Public functions
//-----------------------------------------------------------------------------------------------------------//

Button::Button(float width, float height, D3DXVECTOR2 pos, int texID, int vtxID)
	: m_Width(width)
	, m_Height(height)
	, m_Pos(pos)
	, m_TexID(texID)
	, m_VtxID(vtxID)
{
}

Button::~Button()
{
}

